
%   内容：同定した伝達関数の同定モデルの一致率とステップ応答を表示し評価し関数ｍファイル(evaluateTfModel.m)
%
%   注意事項：なし
%
%   引数:
%       1.IdentifiedTfModel
%           型：tf
%           内容：同定された連続時間伝達関数の同定モデル
%       2.idEvaluateData
%           型：idss
%           内容：同定に使用された入出力データ
%       3.estimatedDiscreteSSeModel
%           型：tf
%           内容：同定結果として得られた離散状態空間モデル
%
%   作成者：船津優斗
%   作成日：2021/4/1                                                        
%                                                                          
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% 

function evaluateTfModel (IdentifiedTfModel,idEvaluateData,estimatedDiscreteSSeModel)

   %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% 異常時の処理 %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

    % 【todo】無駄時間が負となり、厳密にプロパーになりえない因果律（未来の値が過去の値に影響を及ぼす）時は処理を中止するガード節を書く
    
    %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% 以下正常時の処理 %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    
%% 同定モデルの評価

    % 同定モデルと評価データ表示の為に新規figオブジェクトの作成
    figure('Name','同定モデルのフィット率評価');

    % 同定モデルと評価用データの比較
    compare(idEvaluateData,estimatedDiscreteSSeModel)
    
    % 可視性向上の為にグリッドを追記
    grid on    
    
    % コマンドウィンドウへの動作状況の表示
    fprintf("同定モデルの評価を行いました。\n");

    % 設計した制御系のステップ応答表示のために新しいfigオブジェクトを作成
    figure('Name','同定モデル評価用ステップ応答');

    % 設計した制御系のステップ応答を表示
    step(IdentifiedTfModel);
    
    % 可視性向上の為にグリッドを追記
    grid on  
    
    % コマンドウィンドウへの動作状況の表示
    fprintf("設計した制御系のステップ応答を作画しました。\n");
    
end